// ScrollableComponent.tsx

import { motion } from 'framer-motion';
// import Approaching from '../assets/approaching.jpg';
import ImageSliderImg1 from '../assets/approaching.jpg';
// import ImageSliderImg2 from '../assets/profile.jpg';
import ImageSliderImg3 from '../assets/imageslider3.jpeg';
import ImageSliderImg4 from '../assets/imageslider4.jpeg';
import ImageSliderImg5 from '../assets/imageslider5.jpeg';
import ImageSliderImg6 from '../assets/imageslider6.jpeg';
import '../CssFiles/mobileStyles.css'; // Adjust path as necessary

const Aboutme = () => {
    return (
        <motion.div
            initial={{ opacity: 0 }}
            animate={{ opacity: 1 }}
            transition={{ duration: 0.5 }}
            className="mobile-content"
        >
            <div className='bannerDiv'>
                <strong className="title">.היי כאן דולב</strong>
                <strong className='subTitle'>...הכל התחיל לפני כ-10 שנים</strong>

                <div className='aboutme'>
                    <img className='approachingImg' src={ImageSliderImg1} alt="Feature" />
                    <strong className='approachingText'>כל ערב בילוי, כל משיכה אפית, כל בדיחה מצחיקה ואפילו כל כישלון<span className='approachingTextBold'>גרמו לי להרגיש חי</span>.
                        צעדי הראשונים לאורך השביל הזה היו מסומנים בכאב רב.
                        הייתי מופנם, מאופיין, ולסביבתי היו לי בעיות עם קשרים חברתיים ויצירת חברים. הסתובבתי הרבה, ו- תמיד תפסו אותי. תמיד הרגשתי מוזר, מבודד ומחוץ לקבוצה - ככל שניסיתי להכיר חברים, כך זה החמיר.
                        הבחורה הראשונה שאהבתי סטרה לי בפנים, הבחורה הראשונה שפניתי אליה נתנה לי מספר מזויף, <strong className='approachingTextBold'>והחברה הראשונה שהייתה לי אפילו לא תקיים איתי יחסי מין</strong>.
                        החברים שהייתי מוקף בהם התחילו להתעלם ממני, בסופו של דבר הרגשתי עזוב, ונדחפתי עמוק יותר ויותר לתוך הראש שלי.</strong>

                    <strong className='approachingText'>כשסוף סוף התחלתי לצאת - ביליתי את השנתיים הראשונות שלי… לבד.
                        התמודדתי עם <strong className='approachingTextBold'>דחייה על גבי דחייה על גבי דחייה</strong> - וזה היה פשוט מדכא.
                        בשלב הזה של החיים כבר התרגלתי לכאב - ובגלל שהתחלתי ממקום כל כך נמוך - הדחייה הייתה טובה מכלום.
                        למרות המאבק העצום שהיה לי עם עצמי, המשכתי ללכת המשכתי בדרך. והסיבה הייתה - הייתה לי מטרה גדולה...לא הייתה לי ברירה אחרת.
                        לא יכולתי להסתובב, כי לא היה לי למה לחזור.
                        כל מה שרציתי זה להתקבל, להרגיש נאהב, להיות מסוגל ליותר, לדעת להתחבר לסובבים אותי ולרכוש חברים אמיתיים.</strong>

                    <img className='approachingImg' src={ImageSliderImg6} alt="Feature" />

                    <strong className='approachingText'>
                        יצאתי ויצאתי, לילה אחרי לילה, דחפתי את עצמי חזק יותר וחזק יותר.
                        ואז, אחרי אינספור לילות ללא שינה ויציאות... סוף סוף יש לי חברה.
                        העניין הוא, שלמרות ש"הייתה לי חברה",<strong className='approachingTextBold'>היא לא קיימה איתי יחסי מין!</strong>
                        כנראה זה הדבר הכי עצוב שראית אי פעם, אבל זאת הייתה המציאות שלי.
                    </strong>


                    <strong className='approachingText'>
                        הנה אני, הבחור הנחמד והחנוני הזה… והחברה שלי לא רוצה לעשות איתי סקס, זה היה באמת פתטי.
                        עכשיו כשאתה קורא את זה אתה בטח שואל את עצמך:
                        ״מה זה משנה בכלל?״
                        זה משנה, כי אתה משנה.
                        <strong className='approachingTextBold'>
                            ״כמה שהבעיה יותר אישית ככה היא יותר אוניברסלית״
                        </strong>
                        הדברים שאתה עובר עכשיו הם בדיוק הדברים שאני עברתי.
                        אותם המאבקים, אותם תלאות וקשיים שאתה מתמודד איתם היום אני התמודדתי בעבר.
                        הסיפור שלי הוא הסיפור שלך.
                        ומתוך הדחיות והנפילות האלו, אני למדתי שיעורים קריטיים בחיים שלי שיש לי את הפריוילגיה לשתף איתך היום.
                        זאת היתה התשוקה שלי ללמד בשילוב עם הסיפור האישי שלי, ובשילוב עם כוח ויכולת אין סופית לשנות את החיים שלך שגרמו לי להבין:
                        אני חייב לשתף את זה
                        וזאת בדיוק הסיבה שיצרתי את: הצלחה עם נשים ברשתות חברתיות
                    </strong>

                    <img className='approachingImg' src={ImageSliderImg3} alt="Feature" />

                    <strong className='approachingText'>
                        אני אגיד לך בדיוק מה הוא  הקורס הזה ולמה הוא חשוב לך כל כך בנקודה שבה אתה נמצא עכשיו, אבל קודם כל אני אסביר לך למה יצרתי אותו, כדי שתוכל להבין איך אתה משתלב בכל המסע הזה, ולמה זה רגע כל כך קריטי בשבילך.
                    </strong>


                    <strong className='approachingText'>
                        כשהיית צעיר היה לך את זה…
                        את ההרגשה הזאת של כוח בלתי ניתן לעצירה, אפשרויות
                        אין - סופיות, ההרגשה הזאת של הרפתקה חסרת מעצורים.
                        ההרגשה שיש עולם חדש ממש לפניך, מוכן שתכבוש אותו.
                        החלומות שלך היו מהדהדים לך בראש כמו כדורי פינג - פונג, הדמיון שלך יקח אותך למקומות שאחרים רק יוכלו לחלום עליהם.
                        ובכל זאת, איפה שהוא בדרך שלך משהו קרה…
                    </strong>

                    <img className='approachingImg' src={ImageSliderImg4} alt="Feature" />

                    <strong className='approachingText'>
                        אתה איבדת את זה.
                        את התחושה הזאת של המשחק, התחושה הזאת של הכיף, את התחושה של האישור…
                        התחושה הזאת שאפשר, של להפוך להיות גדול, עוצמתי, בלתי ניתן לעצירה…
                        התחושה הזאת של להיות
                        <strong className='approachingTextBold'>
                            הגבר הטוב ביותר שאתה יכול להיות.
                        </strong>
                        אתה איבדת את זה, בגלל שהחיים נתנו לך בוקס בפנים.
                        אולי זאת היתה העבודה הזאת שלא הצלחת להשיג..
                        אולי זאת היתה הבחורה הזאת שאתה פשוט לא הצלחת להבין אותה…
                        אולי זאת היתה ההזדמנות הזאת שחלפה ונעלמה..
                        זה זעזע אותך, גרם לך לטראומה, נתן לך סטירה לפנים וניער אותך מהמציאות שאתה נמצא בה.
                        זה גרם לך להרגיש שהתקוות האלה, החלומות האלה, התשוקות האלה, לא היו אמיתיות, זה גרם לך להאמין שהשאיפות שלך היו מדומיינות, זה גרם לך להאמין שלא מגיע לך את זה
                    </strong>


                    <strong className='approachingText'>
                        זה הפיל אותך למטה, רימה אותך.
                        כישלון ועוד כישלון הגיע ונבנה… אחד אחרי השני… כל פעם שניסית, נכשלת… עוד פעם ועוד פעם ועוד פעם.
                        עד שבסוף, אתה פשוט לא האמנת בזה יותר.
                        החלומות האלה, התשוקות האלה, התקוות האלה - הם פתאום הפכו לפנטזיה רחוקה - משהו שחשבת עליו המון אבל לעולם לא יישמת אותו.
                        זה היה מסוכן מידי, ללא סיכוי, זה הפך אותך לחסר אונים ולא יכולת פשוט ״ללכת על זה״.
                        פצע חדש נפתח, פצע נפשי שקישר את המושג ״לרדוף אחרי החלומות שלך״ ל - ״כאב״ - בתוך הראש שלך.
                        כמה שניסית להתעלם מזה, כמה שניסית להתחמק מזה, ככה זה נהיה יותר עוצמתי ומכאיב.
                    </strong>

                    <img className='approachingImg' src={ImageSliderImg5} alt="Feature" />

                    <strong className='approachingText'>
                        <strong className='approachingTextBold'>
                            וזה הרס אותך.
                        </strong>
                        זה הרס אותך בתור גבר.
                        זה הרס אותך בתור אישיות.
                        זה הרס אותך בתור בן אדם.
                        אתה איבדת את מושב הכוח שלך בתור גבר…
                        אתה איבדת את החשק להתגבר על קשיים…
                        אתה איבדת את התשוקה שלך להלחם בכל מכשול בדרך שלך…
                        הכאב ניצח אותך, והוא שקע עמוק… כל כך עמוק שאפילו שאתה יושב כאן, עכשיו, וקורא את זה - אתה לא מרגיש אותו שם.
                        זה כאב שקשה מידי להתמודד מולו לבד, בגלל שכאשר אתה מתבונן עמוק, כאשר אתה מסתכל לו ישר בעיניים,
                        <strong className='approachingTextBold'>
                        זה שורף.
                        זה כאב שבולע אותך, מטביע אותך, ושולט בך 
                        </strong>
                        - גם אם אתה מודע לכך וגם אם לא.
                        זה כאב שאתה אוליי אפילו לא הבנת שהוא קיים, או כאב שאתה מזמן כבר שכחת אותו.
                        זה כמו הזמזום של המקרר ברקע.
                        זה שם, עמוק בפנים… וזה משפיע על כל דבר שאתה עושה.
                    </strong>

                    <strong className='title'>
                        כמו שאתה יודע, המסע שלי היה מלא בכאב, בדחיות, בקשיים, ובאתגרים תמידיים
                        וזאת הסיבה שהייתי חייב ליצור את <strong className='approachingTextFinal'>הצלחה עם נשים ברשתות חברתיות באינסטגרם וטינדר</strong>
                    </strong>
                </div>

                <div className='headerDiv' style={{ padding: '5%' }}>

                </div>

            </div>

        </motion.div>
    );
};

export default Aboutme;
